tap "hidetatz/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "python@3.11"
brew "awscli"
brew "chezmoi"
brew "chroma"
brew "coreutils"
brew "dos2unix"
brew "exa"
brew "gnutls"
brew "findutils"
brew "fish"
brew "gawk"
brew "gifski"
brew "git"
brew "git-extras"
brew "gnu-getopt"
brew "git-flow-avh"
brew "git-lfs"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "go"
brew "grep"
brew "helm"
brew "htop"
brew "hugo"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "krew"
brew "kubectx"
brew "less"
brew "lsd"
brew "mas"
brew "nethack"
brew "oh-my-posh"
brew "pstree"
brew "scummvm"
brew "ssh-copy-id"
brew "starship"
brew "terraform"
brew "thefuck"
brew "watch"
brew "wget"
brew "hidetatz/tap/kubecolor"
cask "1password"
cask "adobe-creative-cloud"
cask "affinity-designer"
cask "affinity-photo"
cask "affinity-publisher"
cask "apparency"
cask "arq"
cask "bartender"
cask "blockblock"
cask "chromium"
cask "coteditor"
cask "discord"
cask "dotnet"
cask "fantastical"
cask "firefox"
cask "fliqlo"
cask "font-devicons"
cask "font-go-mono-nerd-font"
cask "gitup"
cask "google-chrome"
cask "grandperspective"
cask "handbrake"
cask "home-inventory"
cask "hush"
cask "iina"
cask "istat-menus"
cask "kap"
cask "karabiner-elements"
cask "keycastr"
cask "kitty"
cask "knockknock"
cask "makemkv"
cask "meetingbar"
cask "micro-snitch"
cask "microsoft-teams"
cask "mimestream"
cask "monitorcontrol"
cask "monodraw"
cask "mouse-fix"
cask "obsidian"
cask "onedrive"
cask "openemu"
cask "openlens"
cask "oversight"
cask "plex"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "rectangle"
cask "rocket"
cask "signal"
cask "slack"
cask "steam"
cask "syntax-highlight"
cask "telegram"
cask "transmission"
cask "transmission-remote-gui"
cask "utm"
cask "visual-studio-code"
cask "xbar"
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Apple Configurator", id: 1037126344
mas "Brother iPrint&Scan", id: 1193539993
mas "Clocker", id: 1056643111
mas "DevUtils", id: 1533756032
mas "GarageBand", id: 682658836
mas "Gifox", id: 1461845568
mas "Hand Mirror", id: 1502839586
mas "HotKey", id: 975890633
mas "iMovie", id: 408981434
mas "In Your Face", id: 1476964367
mas "Keynote", id: 409183694
mas "Mapper", id: 1589391989
mas "Milkshake", id: 1440379601
mas "myTuner Radio Pro", id: 808285143
mas "Noizio", id: 928871589
mas "Numbers", id: 409203825
mas "OmniFocus", id: 1346203938
mas "OmniGraffle", id: 1142578753
mas "Pages", id: 409201541
mas "Parcel", id: 639968404
mas "Paste", id: 967805235
mas "Petrify", id: 1451177988
mas "Relax", id: 1440712920
mas "SomaFM", id: 449155338
mas "StopTheMadness", id: 1376402589
mas "Xcode", id: 497799835
